site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@

** DP: Knapsack 2
:PROPERTIES:
:EXPORT_FILE_NAME: dp_knapsack_2
:EXPORT_DATE: 2023-03-06
:END:
The Knapsack problem is famous. How to fill a sack with items that are of maximal value without breaking the sack?

Last class we discussed how to do this using a classic algorithm. This time we will combine dynamic programming with
divide and conquer to make a truly fast version that can solve knapsack with repetitions.

*** Slides
- [[/slides/dp-knapsack-2.pdf][DP: Knapsack]]
- [[/code/knapsack2.cpp][source code]]

